import z from "zod";

export const adminUserSchema = z
  .object({
    name: z.string().min(2, { message: "ชื่อต้องมีอย่างน้อย 2 ตัวอักษร" }),
    cid: z.string().regex(/^\d{13}$/, {
      message: "เลขประจำตัวประชาชนต้องเป็นตัวเลข 13 หลัก",
    }),
    tel: z.string().regex(/^0\d{8,9}$/, {
      message: "เบอร์โทรศัพท์ต้องขึ้นต้นด้วย 0 และมี 9 หรือ 10 หลัก",
    }),
    email: z.email({ message: "รูปแบบอีเมลไม่ถูกต้อง" }),
    position: z
      .string()
      .min(2, { message: "ตำแหน่งต้องมีอย่างน้อย 2 ตัวอักษร" }),
    department: z
      .string()
      .min(2, { message: "หน่วยงานต้องมีอย่างน้อย 2 ตัวอักษร" }),
    username: z
      .string()
      .min(4, { message: "ชื่อผู้ใช้ต้องมีอย่างน้อย 4 ตัวอักษร" })
      .max(50),
    password: z
      .string()
      .min(8, { message: "รหัสผ่านต้องมีอย่างน้อย 8 ตัวอักษร" })
      .regex(/^(?=.*[a-z])(?=.*[A-Z])(?=.*\d).+$/, {
        message: "รหัสผ่านต้องมีตัวพิมพ์เล็ก ตัวพิมพ์ใหญ่ และตัวเลข",
      }),
    confirmPassword: z.string(),
    role: z.enum(["user", "admin"], { message: "กรุณาเลือกบทบาทผู้ใช้" }),
    isActive: z.boolean(),
  })
  .superRefine((data, ctx) => {
    if (data.password !== data.confirmPassword) {
      ctx.addIssue({
        path: ["confirmPassword"], // 👈 ผูก error กับ field นี้
        message: "รหัสผ่านและยืนยันรหัสผ่านไม่ตรงกัน",
        code: "custom",
      });
    }
  });

export type AdminUserFormValues = z.infer<typeof adminUserSchema>;
